/*  Sillicon-Carbide.cpp | 𝘊․𝘧 tran-sist-or and ﹇-över-gräns. */

import Terminalfun;

typedef void (^Temperature)(double Celsius);

int RestivitySiC₁(Temperature ºC) { return 0; }

#pragma mark - More fun with Gal-l-i-um-Arsenide /äsh-en-idé/ /U are the best, thing/

int RestivityGaAs₁(Temperature ºC) { return 0; }

#pragma mark - Hfe formerly

/*
                                                                             
 I-ds                                                                  │ C2  
 |       ---                                                          ━━━    
 |     /                                                              ━━━    
 | ---                                                            │    │     
 --------> V-gs                                                   │          
                                                 C1            ║<-┘          
           │ Drain                             ──┃┃────\/\/────║             
        ||-┘                                                   ║──┐          
 Gate ──||       a․k․a 2-bit and 'när-trasig'.                    │          
        ||─> Source                                               │          
           │                                                   ║──┘          
           │                                                ┌──║             
                                    -                       │  ║->┐          
                                      \   |     -         ──┘     │          
     -----          -----              \  |   /                   │          
    | O O |        | O O |              \ | /                     │          
    |     |        |     |               ||                                  
     -----          -----                ||                                  
   Recollect    Reminiscient             ||                                  
      Run           Hide                                                     
                                     ┌─────────────────────────┬────────────┐ 
                                     │                         │            │ 
                                     ├─────────────────────────┼────────────┤ 
                                     │                         │ 2021-01-08 │ 
                                     └─────────────────────────┴────────────┘ 
                                                                             
 */
